tap "elastic/tap"
tap "felixkratz/formulae"
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "incu6us/tap"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "ngrok/ngrok"
tap "shivammathur/php"
brew "act"
brew "openssl@3"
brew "atuin"
brew "automake"
brew "pycparser"
brew "cffi"
brew "python-cryptography"
brew "readline"
brew "sqlite"
brew "python@3.11"
brew "aws-elasticbeanstalk"
brew "docutils"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "python@3.12"
brew "black"
brew "blueutil"
brew "cairo"
brew "chezmoi"
brew "curl"
brew "freetds"
brew "gd"
brew "krb5"
brew "composer"
brew "coreutils"
brew "docker"
brew "docker-compose"
brew "exa"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-flow"
brew "tcl-tk"
brew "git-gui"
brew "gitleaks"
brew "go"
brew "gofumpt"
brew "golines"
brew "gopls"
brew "gts"
brew "harfbuzz"
brew "graphviz"
brew "hadolint"
brew "httpd"
brew "jq"
brew "libffi"
brew "lsd"
brew "lynx"
brew "mackup"
brew "macvim"
brew "mycli"
brew "mypy"
brew "zlib"
brew "mysql-client"
brew "mysql@8.0"
brew "neovim"
brew "neovide"
brew "node", link: false
brew "nvm"
brew "openssl@1.1"
brew "pgcli"
brew "pnpm"
brew "postgresql@14", restart_service: true
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyright"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruff"
brew "rust-analyzer"
brew "shellcheck"
brew "solargraph"
brew "stylua"
brew "switchaudio-osx"
brew "tailwindcss-language-server"
brew "tig"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "trash"
brew "typescript"
brew "typescript-language-server"
brew "ugrep"
brew "virtualenv"
brew "watchman"
brew "wget"
brew "yaml-language-server"
brew "yarn"
brew "zoxide"
brew "zsh"
brew "felixkratz/formulae/sketchybar"
brew "fsouza/prettierd/prettierd"
brew "incu6us/tap/goimports-reviser"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "koekeishiya/formulae/skhd"
brew "shivammathur/php/php@7.4"
cask "adobe-creative-cloud"
cask "alacritty"
cask "chromedriver"
cask "cloudflare-warp"
cask "dbngin"
cask "evkey"
cask "figma"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "google-drive"
cask "herd"
cask "imageoptim"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "maccy"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "ngrok"
cask "numi"
cask "postman"
cask "raycast"
cask "rectangle"
cask "sf-symbols"
cask "sioyek"
cask "spacelauncher"
cask "tableplus"
cask "telegram-desktop"
cask "vieb"
cask "visual-studio-code"
cask "warp"
cask "wezterm"
cask "zoom"
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "albert.tabout"
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "aliariff.vscode-erb-beautify"
vscode "alperg.slack-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amodio.tsl-problem-matcher"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "asvetliakov.vscode-neovim"
vscode "benspaulding.procfile"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "blanu.vscode-styled-jsx"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "bungcip.better-toml"
vscode "castwide.solargraph"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "flowtype.flow-for-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.docker-explorer"
vscode "formulahendry.docker-extension-pack"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gracefulpotato.rbs-syntax"
vscode "grapecity.gc-excelviewer"
vscode "groksrc.ruby"
vscode "gruntfuggly.todo-tree"
vscode "harvey1998.harvey"
vscode "harvey1998.harvey-generation"
vscode "harvey1998.harvey-snippets"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "hollowtree.vue-snippets"
vscode "hoovercj.ruby-linter"
vscode "hoovercj.vscode-power-mode"
vscode "hridoy.rails-snippets"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "james-yu.latex-workshop"
vscode "janne252.fontawesome-autocomplete"
vscode "jasonlhy.hungry-delete"
vscode "jcbuisson.vue"
vscode "jemmyw.rails-fast-nav"
vscode "jeroen-meijer.pubspec-assist"
vscode "jmrog.vscode-nuget-package-manager"
vscode "johnpapa.vscode-peacock"
vscode "kaiwood.endwise"
vscode "karunamurti.haml"
vscode "kelset.rn-full-pack"
vscode "koichisasada.vscode-rdbg"
vscode "leodevbro.blockman"
vscode "mateuszdrewniak.rails-full-stack-extension-pack"
vscode "mateuszdrewniak.rbs-snippets"
vscode "mateuszdrewniak.ruby-runner"
vscode "mateuszdrewniak.ruby-test-runner"
vscode "mateuszdrewniak.theme-dracula-dark-plus"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mgwg.light-pink-theme"
vscode "mhutchie.git-graph"
vscode "miguel-savignano.ruby-symbols"
vscode "mintlify.document"
vscode "mrmlnc.vscode-duplicate"
vscode "mrmlnc.vscode-scss"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "naco-siren.gradle-language"
vscode "naumovs.color-highlight"
vscode "nhoizey.gremlins"
vscode "ninoseki.vscode-gem-lens"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pascalsenn.keyboard-quickfix"
vscode "patersonanaccius.unittestai"
vscode "pavlitsky.yard"
vscode "petems.mit-license-adder"
vscode "pflannery.vscode-versionlens"
vscode "philosowaffle.openapi-designer"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "rangav.vscode-thunder-client"
vscode "rayhanw.erb-helpers"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "richardwillis.vscode-gradle-extension-pack"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "shan.code-settings-sync"
vscode "shardulm94.trailing-spaces"
vscode "sianglim.slim"
vscode "silesky.toggle-boolean"
vscode "silvenon.mdx"
vscode "soutaro.steep-vscode"
vscode "sporto.rails-go-to-spec"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tabnine.tabnine-vscode"
vscode "teamhub.teamhub"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "usernamehw.errorlens"
vscode "vayan.haml"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vortizhe.simple-ruby-erb"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vuetifyjs.vuetify-vscode"
vscode "waderyan.gitblame"
vscode "waderyan.nodejs-extension-pack"
vscode "walkme.ruby-extension-pack"
vscode "wayou.vscode-todo-highlight"
vscode "william-voyek.vscode-nginx"
vscode "wingrunr21.vscode-ruby"
vscode "wix.glean"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zignd.html-css-class-completion"
vscode "ziyasal.vscode-open-in-github"
