tap "elastic/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Simple terminal UI for git commands
brew "lazygit"
# Portable Foreign Function Interface library
brew "libffi"
# Postgres C API library
brew "libpq"
# Open source relational database management system
brew "mysql", restart_service: true
# No Nonsense Neovim Client in Rust
brew "neovide"
# Manage multiple Node.js versions
brew "nvm"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql@14"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# JavaScript package manager
brew "yarn"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# GPU-accelerated terminal emulator
cask "alacritty"
# Vietnamese keyboard
cask "evkey"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Clipboard manager
cask "maccy"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
vscode "42Crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "aki77.rails-db-schema"
vscode "albert.TabOut"
vscode "alefragnani.Bookmarks"
vscode "alefragnani.project-manager"
vscode "aliariff.slim-lint"
vscode "aliariff.vscode-erb-beautify"
vscode "alperg.slack-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amodio.tsl-problem-matcher"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "asvetliakov.vscode-neovim"
vscode "be5invis.vscode-custom-css"
vscode "benspaulding.procfile"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "blanu.vscode-styled-jsx"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "bungcip.better-toml"
vscode "castwide.solargraph"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "CraigMaslowski.erb"
vscode "cschlosser.doxdocgen"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "eg2.vscode-npm-script"
vscode "emilast.LogFileHighlighter"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "flowtype.flow-for-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.docker-explorer"
vscode "formulahendry.docker-extension-pack"
vscode "GitHub.copilot"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "GracefulPotato.rbs-syntax"
vscode "GrapeCity.gc-excelviewer"
vscode "groksrc.ruby"
vscode "Gruntfuggly.todo-tree"
vscode "guillaumedoutriaux.name-that-color"
vscode "harvey1998.harvey"
vscode "harvey1998.harvey-generation"
vscode "harvey1998.harvey-snippets"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "hollowtree.vue-snippets"
vscode "hoovercj.ruby-linter"
vscode "hoovercj.vscode-power-mode"
vscode "Hridoy.rails-snippets"
vscode "humao.rest-client"
vscode "Huuums.vscode-fast-folder-structure"
vscode "IBM.output-colorizer"
vscode "illixion.vscode-vibrancy-continued"
vscode "James-Yu.latex-workshop"
vscode "janjoerke.align-by-regex"
vscode "Janne252.fontawesome-autocomplete"
vscode "jasonlhy.hungry-delete"
vscode "jasonnutter.search-node-modules"
vscode "jcbuisson.vue"
vscode "jemmyw.rails-fast-nav"
vscode "jeroen-meijer.pubspec-assist"
vscode "jmrog.vscode-nuget-package-manager"
vscode "johnpapa.vscode-peacock"
vscode "kaiwood.endwise"
vscode "karunamurti.haml"
vscode "kelset.rn-full-pack"
vscode "KoichiSasada.vscode-rdbg"
vscode "leodevbro.blockman"
vscode "LoranKloeze.ruby-rubocop-revived"
vscode "MateuszDrewniak.rails-full-stack-extension-pack"
vscode "MateuszDrewniak.rbs-snippets"
vscode "MateuszDrewniak.ruby-runner"
vscode "MateuszDrewniak.ruby-test-runner"
vscode "MateuszDrewniak.theme-dracula-dark-plus"
vscode "mathiasfrohlich.Kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mgwg.light-pink-theme"
vscode "mhutchie.git-graph"
vscode "MichalZaporski.simple-yard-snippets"
vscode "miguel-savignano.ruby-symbols"
vscode "mikestead.dotenv"
vscode "mintlify.document"
vscode "misogi.ruby-rubocop"
vscode "mrmlnc.vscode-duplicate"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "naco-siren.gradle-language"
vscode "naumovs.color-highlight"
vscode "nhoizey.gremlins"
vscode "nickytonline.dev-to-extension-pack"
vscode "ninoseki.vscode-gem-lens"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pascalsenn.keyboard-quickfix"
vscode "pavlitsky.yard"
vscode "petems.mit-license-adder"
vscode "pflannery.vscode-versionlens"
vscode "philosowaffle.openapi-designer"
vscode "PKief.material-icon-theme"
vscode "pnp.polacode"
vscode "rangav.vscode-thunder-client"
vscode "rayhanw.erb-helpers"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "richardwillis.vscode-gradle-extension-pack"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "Shan.code-settings-sync"
vscode "shardulm94.trailing-spaces"
vscode "sianglim.slim"
vscode "silesky.toggle-boolean"
vscode "silvenon.mdx"
vscode "SonarSource.sonarlint-vscode"
vscode "soutaro.steep-vscode"
vscode "sporto.rails-go-to-spec"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "syler.sass-indented"
vscode "TabNine.tabnine-vscode"
vscode "TeamHub.teamhub"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "ttda.ritmica"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vayan.haml"
vscode "vincaslt.highlight-matching-tag"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vortizhe.simple-ruby-erb"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "vuetifyjs.vuetify-vscode"
vscode "waderyan.gitblame"
vscode "waderyan.nodejs-extension-pack"
vscode "walkme.Ruby-extension-pack"
vscode "WallabyJs.quokka-vscode"
vscode "wayou.vscode-todo-highlight"
vscode "william-voyek.vscode-nginx"
vscode "wingrunr21.vscode-ruby"
vscode "wix.glean"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "xabikos.JavaScriptSnippets"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "xyz.local-history"
vscode "yzhang.markdown-all-in-one"
vscode "ZainChen.json"
vscode "Zignd.html-css-class-completion"
vscode "ziyasal.vscode-open-in-github"
vscode "zobo.php-intellisense"
